[
  {
    "role": "Frontend Engineer",
    "company": "Primuse Entertainment",
    "type": "Full-time",
    "date": "July 2025 → Present · 5 MNTHS",
    "location": "Bali, Indonesia · Remote",
    "description": "I developed Kisum, a B2B web application designed for event promoters and agencies. I collaborated cross-functionally with backend, frontend, and UI/UX teams to successfully deliver the application MVP. I also improved the Primuse website by optimizing performance and enhancing overall user experience."
  },
  {
    "role": "Frontend Engineer",
    "company": "MINDSET LAB CREATIVE",
    "type": "Full-time",
    "date": "May 2024 → June 2025 · 1 YR 2 MNTHS",
    "location": "Jakarta, Indonesia · On-site",
    "description": "At MINDSET LAB, I developed a job portal application from ideation to implementation and created the MINDSETLAB CREATIVE website to showcase our portfolio. I also supported the development of a WordPress project for Solusi Bangun Indonesia and contributed to major BRI projects like BRImo FSTVL, Qlola, BRImo Merchant, and BRImo Microsite by developing new features and implementing SEO strategies. Additionally, I built the ZoetisPetz App for veterinary and animal clinic users."
  },
  {
    "role": "Frontend Engineer",
    "company": "Freelance (Self employed)",
    "type": "Freelance",
    "date": "Feb 2022 → Nov 2024 · 2 YRS 10 MNTHS",
    "location": "Bekasi, West Java, Indonesia · Remote",
    "description": "During my freelance journey, I developed a university website complete with registration and student check features, a mobile web app for coffee shops with QRIS payment, coupons, and real-time order notifications, and a CMS to help clients manage their product catalogs seamlessly."
  },
  {
    "role": "Frontend Developer",
    "company": "PT Healstation Indonesia",
    "type": "Full-time",
    "date": "Mar 2023 → Apr 2024 · 1 YRS 2 MNTHS",
    "location": "Indonesia · Hybrid",
    "description": "At PT HEALSTATION INDONESIA, I worked on a Korean e-commerce web application tailored for dental health clinics. I was responsible for developing new features and bug fixing for a Korean Government Project, while also building landing pages and mobile apps using React Native to expand the company’s digital reach."
  },
  {
    "role": "Frontend Developer",
    "company": "PT Bank Rakyat Indonesia (Persero) Tbk",
    "type": "Full-time",
    "date": "Nov 2022 → Feb 2023 · 4 MNTHS",
    "location": "Bandung, Indonesia · On-site",
    "description": "I contributed to PT Bank Rakyat Indonesia as a frontend developer, building web modules for various banking applications. I collaborated closely with backend developers for smooth feature integration, ensured production-level stability of the banking web apps, and worked in agile teams with clear sprint goals."
  },
  {
    "role": "Fullstack Developer",
    "company": "PT. DumbWays Indonesia Teknologi",
    "type": "Apprenticeship",
    "date": "Aug 2022 → Oct 2022 · 3 mos",
    "location": "South Tangerang, Banten · On-site",
    "description": "Through the DumbWays bootcamp, I completed intensive training as a fullstack developer with React, Golang, Node, and React Native. I contributed to projects like Dumbflix, Cinema Online, a Todo App, and built my own personal portfolio — sharpening both my technical and collaboration skills."
  }
]
